#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_address.minecraft will be created
  + resource "google_compute_address" "minecraft" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "minecraft-ip"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "us-east1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_disk.minecraft will be created
  + resource "google_compute_disk" "minecraft" {
      + creation_timestamp        = (known after apply)
      + id                        = (known after apply)
      + image                     = "cos-cloud/cos-stable"
      + label_fingerprint         = (known after apply)
      + last_attach_timestamp     = (known after apply)
      + last_detach_timestamp     = (known after apply)
      + name                      = "minecraft"
      + physical_block_size_bytes = (known after apply)
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + size                      = (known after apply)
      + source_image_id           = (known after apply)
      + source_snapshot_id        = (known after apply)
      + type                      = "pd-standard"
      + users                     = (known after apply)
      + zone                      = "us-east1-b"
    }

  # google_compute_disk_resource_policy_attachment.backup_policy_attachment will be created
  + resource "google_compute_disk_resource_policy_attachment" "backup_policy_attachment" {
      + disk    = "minecraft"
      + id      = (known after apply)
      + name    = "minecraft-backup-policy"
      + project = (known after apply)
      + zone    = "us-east1-b"
    }

  # google_compute_firewall.minecraft will be created
  + resource "google_compute_firewall" "minecraft" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "minecraft"
      + network            = "minecraft"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "minecraft",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "25565",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # google_compute_instance_group_manager.minecraft will be created
  + resource "google_compute_instance_group_manager" "minecraft" {
      + base_instance_name = "minecraft"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + name               = "minecraft"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_size        = 1
      + wait_for_instances = false
      + zone               = "us-east1-b"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = (known after apply)
        }
    }

  # google_compute_instance_template.minecraft will be created
  + resource "google_compute_instance_template" "minecraft" {
      + can_ip_forward          = false
      + id                      = (known after apply)
      + machine_type            = "n1-highcpu-2"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
            docker run -d \
              --name=minecraft \
              --restart=always \
              -p 25565:25565 \
              -e DIFFICULTY=hard \
              -e ENABLE_RCON=true \
              -e EULA=TRUE \
              -e SEED=-2143500864 \
              -v /var/minecraft:/data \
              itzg/minecraft-server:2021.6.0-multiarch;
        EOT
      + name                    = (known after apply)
      + name_prefix             = "minecraft-template-"
      + project                 = (known after apply)
      + region                  = (known after apply)
      + self_link               = (known after apply)
      + tags                    = [
          + "minecraft",
        ]
      + tags_fingerprint        = (known after apply)

      + disk {
          + auto_delete  = false
          + boot         = (known after apply)
          + device_name  = (known after apply)
          + disk_size_gb = (known after apply)
          + disk_type    = (known after apply)
          + interface    = (known after apply)
          + mode         = (known after apply)
          + source       = "minecraft"
          + source_image = (known after apply)
          + type         = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "minecraft"
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip                 = (known after apply)
              + network_tier           = (known after apply)
              + public_ptr_domain_name = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = false
          + on_host_maintenance = (known after apply)
          + preemptible         = true
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/userinfo.email",
            ]
        }
    }

  # google_compute_network.minecraft will be created
  + resource "google_compute_network" "minecraft" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "minecraft"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_resource_policy.backup_policy will be created
  + resource "google_compute_resource_policy" "backup_policy" {
      + id        = (known after apply)
      + name      = "minecraft-backup-policy"
      + project   = (known after apply)
      + region    = "us-east1"
      + self_link = (known after apply)

      + snapshot_schedule_policy {
          + retention_policy {
              + max_retention_days    = 30
              + on_source_disk_delete = "KEEP_AUTO_SNAPSHOTS"
            }

          + schedule {
              + daily_schedule {
                  + days_in_cycle = 1
                  + start_time    = "04:00"
                }
            }

          + snapshot_properties {
              + storage_locations = [
                  + "us",
                ]
            }
        }
    }

  # google_service_account.minecraft will be created
  + resource "google_service_account" "minecraft" {
      + account_id   = "minecraft"
      + display_name = "minecraft"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + network_ip = (known after apply)

------------------------------------------------------------------------

This plan was saved to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"


```
</details>
*Pusher: @davegallant, Action: `pull_request`*